wangshi123456ws-art/STM32F407-Engine-Shield-Thickness-Detection-System/SYSTEM/sys/sys.h
#ifndef PROGRAM_OPEN_SYS_H
#define PROGRAM_OPEN_SYS_H

#include "stm32f4xx.h"

#define SYSTEM_SUPPORT_OS 0

#define BITBAND(addr, bitnum) ((addr & 0xF0000000u) + 0x02000000u + ((addr & 0x000FFFFFu) << 5) + ((bitnum) << 2))
#define MEM_ADDR(addr) (*((volatile unsigned long *)(addr)))
#define BIT_ADDR(addr, bitnum) MEM_ADDR(BITBAND((addr), (bitnum)))

#define GPIOA_ODR_Addr (GPIOA_BASE + 20u)
#define GPIOB_ODR_Addr (GPIOB_BASE + 20u)
#define GPIOC_ODR_Addr (GPIOC_BASE + 20u)
#define GPIOD_ODR_Addr (GPIOD_BASE + 20u)
#define GPIOE_ODR_Addr (GPIOE_BASE + 20u)
#define GPIOF_ODR_Addr (GPIOF_BASE + 20u)
#define GPIOG_ODR_Addr (GPIOG_BASE + 20u)
#define GPIOH_ODR_Addr (GPIOH_BASE + 20u)
#define GPIOI_ODR_Addr (GPIOI_BASE + 20u)

#define GPIOA_IDR_Addr (GPIOA_BASE + 16u)
#define GPIOB_IDR_Addr (GPIOB_BASE + 16u)
#define GPIOC_IDR_Addr (GPIOC_BASE + 16u)
#define GPIOD_IDR_Addr (GPIOD_BASE + 16u)
#define GPIOE_IDR_Addr (GPIOE_BASE + 16u)
#define GPIOF_IDR_Addr (GPIOF_BASE + 16u)
#define GPIOG_IDR_Addr (GPIOG_BASE + 16u)
#define GPIOH_IDR_Addr (GPIOH_BASE + 16u)
#define GPIOI_IDR_Addr (GPIOI_BASE + 16u)

#define PAout(n) BIT_ADDR(GPIOA_ODR_Addr, n)
#define PAin(n) BIT_ADDR(GPIOA_IDR_Addr, n)
#define PBout(n) BIT_ADDR(GPIOB_ODR_Addr, n)
#define PBin(n) BIT_ADDR(GPIOB_IDR_Addr, n)
#define PCout(n) BIT_ADDR(GPIOC_ODR_Addr, n)
#define PCin(n) BIT_ADDR(GPIOC_IDR_Addr, n)
#define PDout(n) BIT_ADDR(GPIOD_ODR_Addr, n)
#define PDin(n) BIT_ADDR(GPIOD_IDR_Addr, n)
#define PEout(n) BIT_ADDR(GPIOE_ODR_Addr, n)
#define PEin(n) BIT_ADDR(GPIOE_IDR_Addr, n)
#define PFout(n) BIT_ADDR(GPIOF_ODR_Addr, n)
#define PFin(n) BIT_ADDR(GPIOF_IDR_Addr, n)
#define PGout(n) BIT_ADDR(GPIOG_ODR_Addr, n)
#define PGin(n) BIT_ADDR(GPIOG_IDR_Addr, n)
#define PHout(n) BIT_ADDR(GPIOH_ODR_Addr, n)
#define PHin(n) BIT_ADDR(GPIOH_IDR_Addr, n)
#define PIout(n) BIT_ADDR(GPIOI_ODR_Addr, n)
#define PIin(n) BIT_ADDR(GPIOI_IDR_Addr, n)

void WFI_SET(void);
void INTX_DISABLE(void);
void INTX_ENABLE(void);
void MSR_MSP(u32 addr);

#endif
